---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CeilingStructureIdParam
source: html/6c162733-abab-af27-cc0c-dcdf024258bb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CeilingStructureIdParam Property

"Structure"

## Syntax (C#)
```csharp
public static ForgeTypeId CeilingStructureIdParam { get; }
```